In [3]:
import pandas as pd
pop = pd.read_csv('../data/mock_sysselsatte/population_2019_30000.csv')
comp = pd.read_csv('../data/mock_sysselsatte/companies_2019_30000.csv')

### Repetisjon: Indexing inn til en enkelt verdi

In [14]:
# Kolonnenavn først
pop['age'][0]

0

In [20]:
# Radnavn først
pop.loc[0]['sex']

'Menn'

### "Keep"

In [4]:
pop.columns

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

In [5]:
pop[['sex', 'age', 'work_percent']]

           sex  age  work_percent
0         Menn    0           NaN
1         Menn    0           NaN
2         Menn    0           NaN
3         Menn    0           NaN
4         Menn    0           NaN
...        ...  ...           ...
29995  Kvinner   93           NaN
29996  Kvinner   93           NaN
29997  Kvinner   90           NaN
29998  Kvinner   90           NaN
29999  Kvinner   90           NaN

[30000 rows x 3 columns]

### "Drop"

In [6]:
pop.drop('age', axis = "columns")

       Unnamed: 0           id  work_id      sex  year_birth  work_percent
0               0  29101946112      NaN     Menn        2019           NaN
1               1  26101930288      NaN     Menn        2019           NaN
2               2  22091952214      NaN     Menn        2019           NaN
3               3   4071997222      NaN     Menn        2019           NaN
4               4   7101970642      NaN     Menn        2019           NaN
...           ...          ...      ...      ...         ...           ...
29995       29995  15072660901      NaN  Kvinner        1926           NaN
29996       29996  23012604128      NaN  Kvinner        1926           NaN
29997       29997  14102931680      NaN  Kvinner        1929           NaN
29998       29998  29062932768      NaN  Kvinner        1929           NaN
29999       29999  11072931487      NaN  Kvinner        1929           NaN

[30000 rows x 6 columns]

### .columns / .keys()

In [7]:
pop.columns

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

In [8]:
pop.keys()

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

##### Bonus: rename kun med .columns

In [10]:
change_names = list(pop.columns)
change_names[0] = 'delete_me' 
pop.columns = change_names

In [11]:
pop.columns

Index(['delete_me', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

### .rename()

In [13]:
# Rename tar en dict, som er veldig fint
renaming = {
    'sex' : 'kjoenn',
    'age' : 'alder'
}
pop.rename(renaming, axis = "columns")

,delete_me,id,work_id,kjoenn,alder,year_birth,work_percent
0,0,29101946112,NaN,Menn,0,2019,NaN
1,1,26101930288,NaN,Menn,0,2019,NaN
2,2,22091952214,NaN,Menn,0,2019,NaN
3,3,4071997222,NaN,Menn,0,2019,NaN
4,4,7101970642,NaN,Menn,0,2019,NaN
...,...,...,...,...,...,...,...
29995,29995,15072660901,NaN,Kvinner,93,1926,NaN
29996,29996,23012604128,NaN,Kvinner,93,1926,NaN
29997,29997,14102931680,NaN,Kvinner,90,1929,NaN
29998,29998,29062932768,NaN,Kvinner,90,1929,NaN
29999,29999,11072931487,NaN,Kvinner,90,1929,NaN